# Reading a text file, TXT

In [3]:
filename = 'data\huck_finn.txt'
file = open(filename, mode = 'r') # 'r' is to read
text = file.read()
file.close()

# Printing a text file

In [4]:
print(text)

CHAPTER I.

YOU don't know about me without you have read a book by the name of The Adventures of Tom Sawyer; but that ain't no matter. That book was made by Mr. Mark Twain, and he told the truth, mainly. There was things which he stretched, but mainly he told the truth. That is nothing. I never seen anybody but lied one time or another, without it was Aunt Polly, or the widow, or maybe Mary. Aunt Polly--Tom's Aunt Polly, she is--and Mary, and the Widow Douglas is all told about in that book, which is mostly a true book, with some stretchers, as I said before.

Now the way that the book winds up is this: Tom and me found the money that the robbers hid in the cave, and it made us rich. We got six thousand dollars apiece--all gold. It was an awful sight of money when it was piled up. Well, Judge Thatcher he took it and put it out at interest, and it fetched us a dollar a day apiece all the year round --more than a body could tell what to do with. The Widow Douglas she took me for her son, and allowed she would sivilize me; but it was rough living in the house all the time, considering how dismal regular and decent the widow was in all her ways; and so when I couldn't stand it no longer I lit out. I got into my old rags and my sugar-hogshead again, and was free and satisfied. But Tom Sawyer he hunted me up and said he was going to start a band of robbers, and I might join if I would go back to the widow and be respectable. So I went back.

In [19]:
filename = 'data\huck_finn.txt'
file = open(filename, mode = 'r') # 'r' is to read
print(file.readline()) # read only one line
file.close()

CHAPTER I.

# Writing to a file

In [ ]:
filename = 'data\huck_finn.txt'
file = open(filename, mode = 'w') # 'w' is to write
file.close()

In [6]:
# check if the file is closed
print(file.closed)

True

# Context manager with
- avoiding obligation of closing the file
- once out of this clause/context, the file is no longer open

In [5]:
with open('data\huck_finn.txt', 'r') as file:
    print(file.read())

CHAPTER I.

YOU don't know about me without you have read a book by the name of The Adventures of Tom Sawyer; but that ain't no matter. That book was made by Mr. Mark Twain, and he told the truth, mainly. There was things which he stretched, but mainly he told the truth. That is nothing. I never seen anybody but lied one time or another, without it was Aunt Polly, or the widow, or maybe Mary. Aunt Polly--Tom's Aunt Polly, she is--and Mary, and the Widow Douglas is all told about in that book, which is mostly a true book, with some stretchers, as I said before.

Now the way that the book winds up is this: Tom and me found the money that the robbers hid in the cave, and it made us rich. We got six thousand dollars apiece--all gold. It was an awful sight of money when it was piled up. Well, Judge Thatcher he took it and put it out at interest, and it fetched us a dollar a day apiece all the year round --more than a body could tell what to do with. The Widow Douglas she took me for her son, and allowed she would sivilize me; but it was rough living in the house all the time, considering how dismal regular and decent the widow was in all her ways; and so when I couldn't stand it no longer I lit out. I got into my old rags and my sugar-hogshead again, and was free and satisfied. But Tom Sawyer he hunted me up and said he was going to start a band of robbers, and I might join if I would go back to the widow and be respectable. So I went back.

# Flat files, CSV

### NumPy
- loadtxt()
- genfromtxt()
- recfromcsv()

In [21]:
import numpy as np
filename = 'data/mnist.csv'
data = np.loadtxt(filename, delimiter = ',')
# '\t' for tab-delimited
data

array([[1., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       ...,
       [2., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [5., 0., 0., ..., 0., 0., 0.]])

In [22]:
# if file contain first line as a header
data = np.loadtxt(filename, delimiter = ',', skiprows= 1)
data

array([[0., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       [4., 0., 0., ..., 0., 0., 0.],
       ...,
       [2., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [5., 0., 0., ..., 0., 0., 0.]])

In [23]:
# ensure all entires are imported as string
data = np.loadtxt(filename, delimiter = ',', dtype= str)
data

array([['1.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0'],
       ['0.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0'],
       ['1.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0'],
       ...,
       ['2.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0'],
       ['0.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0'],
       ['5.0', '0.0', '0.0', ..., '0.0', '0.0', '0.0']], dtype='<U5')

In [33]:
# load the first and last column
data = np.loadtxt(filename, delimiter=',', usecols=[0,-1])
data[:5] # the first 5 rows

array([[1., 0.],
       [0., 0.],
       [1., 0.],
       [4., 0.],
       [0., 0.]])

In [35]:
# if we pass dtype=None to it, it will figure out what types each column should be
# names tells us there is a header
# default: dtype=<class 'float'>
data = np.genfromtxt('data/titanic_sub.csv', delimiter=',', names=True, dtype=None)
data[:5]

C:\Users\AsusF512ua-ej269t\AppData\Local\Temp\ipykernel_25080\2382391426.py:2: VisibleDeprecationWarning: Reading unicode strings without specifying the encoding argument is deprecated. Set the encoding, use None for the system default.
  data = np.genfromtxt('data/titanic_sub.csv', delimiter=',', names=True, dtype=None)

array([(1, 0, 3, b'male', 22., 1, 0, b'A/5 21171',  7.25  , b'', b'S'),
       (2, 1, 1, b'female', 38., 1, 0, b'PC 17599', 71.2833, b'C85', b'C'),
       (3, 1, 3, b'female', 26., 0, 0, b'STON/O2. 3101282',  7.925 , b'', b'S'),
       (4, 1, 1, b'female', 35., 1, 0, b'113803', 53.1   , b'C123', b'S'),
       (5, 0, 3, b'male', 35., 0, 0, b'373450',  8.05  , b'', b'S')],
      dtype=[('PassengerId', '<i4'), ('Survived', '<i4'), ('Pclass', '<i4'), ('Sex', 'S6'), ('Age', '<f8'), ('SibSp', '<i4'), ('Parch', '<i4'), ('Ticket', 'S18'), ('Fare', '<f8'), ('Cabin', 'S15'), ('Embarked', 'S1')])

In [37]:
data['Sex'][:5]

array([b'male', b'female', b'female', b'female', b'male'], dtype='|S6')

In [39]:
# behaves similarly to np.genfromtxt(), except that its default dtype is None
data = np.recfromcsv('data/titanic_sub.csv', delimiter=',', names=True)
data[:5]

C:\Users\AsusF512ua-ej269t\AppData\Local\Programs\Python\Python311\Lib\site-packages\numpy\lib\npyio.py:2520: VisibleDeprecationWarning: Reading unicode strings without specifying the encoding argument is deprecated. Set the encoding, use None for the system default.
  output = genfromtxt(fname, **kwargs)

rec.array([(1, 0, 3, b'male', 22., 1, 0, b'A/5 21171',  7.25  , b'', b'S'),
           (2, 1, 1, b'female', 38., 1, 0, b'PC 17599', 71.2833, b'C85', b'C'),
           (3, 1, 3, b'female', 26., 0, 0, b'STON/O2. 3101282',  7.925 , b'', b'S'),
           (4, 1, 1, b'female', 35., 1, 0, b'113803', 53.1   , b'C123', b'S'),
           (5, 0, 3, b'male', 35., 0, 0, b'373450',  8.05  , b'', b'S')],
          dtype=[('passengerid', '<i4'), ('survived', '<i4'), ('pclass', '<i4'), ('sex', 'S6'), ('age', '<f8'), ('sibsp', '<i4'), ('parch', '<i4'), ('ticket', 'S18'), ('fare', '<f8'), ('cabin', 'S15'), ('embarked', 'S1')])

### Pandas

In [40]:
import pandas as pd
filename = 'data/titanic_sub.csv'
data = pd.read_csv(filename)
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
# numpy array
data_array = data.values
data_array

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [45]:
data = pd.read_csv(filename, nrows =5, header = None )
data.head()

,0,1,2,3,4,5,6,7,8,9,10
0,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,male,22.0,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,female,35.0,1,0,113803,53.1,C123,S

In [46]:
data = pd.read_csv(filename, na_values='female')
data.head()
# sep='\t' - is tab-delimited 
# comment='#' -takes characters that comments occur after '#' in the file
# na_values='Nothing' - takes a list of strings to recognize as NA/NaN

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,NaN,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,NaN,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,NaN,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

# Pickled files
- to store dictionarries and list

In [48]:
import pickle
with open('data\pickled_fruit.pkl', 'rb') as file:
    data = pickle.load(file)
print(data)
# 'rb' - read only binary

['apple', 'orange', 'lemon', 'lime']

# Importing Excel spreadsheets

In [53]:
import pandas as pd
file = 'data\\urban.xlsx'
data = pd.ExcelFile(file)
data.sheet_names

['Data', 'About', 'Footnotes', 'Settings', 'Download', 'v']

In [ ]:
data1 = pd.ExcelFile(file,1) # read teh second sheet

In [54]:
df1 = data.parse('Data') # sheet name as a string
df2 = data.parse(0) # sheet index as a float

In [56]:
df1.head()

,Urban population,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
0,Abkhazia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,769308.0,8.149230e+05,8.585217e+05,9.039139e+05,9.512259e+05,1.000582e+06,1.058743e+06,1.119067e+06,1.182159e+06,...,5.795940e+06,6.036100e+06,6.285281e+06,6.543804e+06,6.812538e+06,7.091245e+06,7.380272e+06,7.679982e+06,7.990746e+06,8.316976e+06
2,Akrotiri and Dhekelia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Albania,494443.0,5.118028e+05,5.294389e+05,5.473767e+05,5.655718e+05,5.839829e+05,6.025122e+05,6.211798e+05,6.399645e+05,...,1.352278e+06,1.391143e+06,1.430918e+06,1.470488e+06,1.512255e+06,1.553491e+06,1.594351e+06,1.635262e+06,1.676545e+06,1.716842e+06
4,Algeria,3293999.0,3.515148e+06,3.739963e+06,3.973289e+06,4.220987e+06,4.488176e+06,4.649105e+06,4.826104e+06,5.017299e+06,...,1.985484e+07,2.052936e+07,2.122220e+07,2.193298e+07,2.262505e+07,2.333554e+07,2.406175e+07,2.479959e+07,2.554562e+07,2.621697e+07

In [58]:
# Parse the first column of the firt sheet and rename the column
df2 = data.parse(0, usecols=[0], skiprows=[0], names=['Country'])
df2.head()

                 Country
0            Afghanistan
1  Akrotiri and Dhekelia
2                Albania
3                Algeria
4         American Samoa

# Importing SAS

In [63]:
import pandas as pd
from sas7bdat import SAS7BDAT
with SAS7BDAT('data\sales.sas7bdat') as file:
    df_sas = file.to_data_frame()

In [65]:
df_sas.head()

     YEAR     P           S
0  1950.0  12.9  181.899994
1  1951.0  11.9  245.000000
2  1952.0  10.7  250.199997
3  1953.0  11.3  265.899994
4  1954.0  11.2  248.500000

# Importing Stata files

In [64]:
import pandas as pd
data = pd.read_stata('data\disarea.dta')

In [66]:
data.head()

,wbcode,country,disa1,disa2,disa3,disa4,disa5,disa6,disa7,disa8,...,disa16,disa17,disa18,disa19,disa20,disa21,disa22,disa23,disa24,disa25
0,AFG,Afghanistan,0.00,0.00,0.76,0.73,0.0,0.00,0.00,0.0,...,0.0,0.0,0.0,0.00,0.00,0.0,0.00,0.02,0.00,0.00
1,AGO,Angola,0.32,0.02,0.56,0.00,0.0,0.00,0.56,0.0,...,0.0,0.4,0.0,0.61,0.00,0.0,0.99,0.98,0.61,0.00
2,ALB,Albania,0.00,0.00,0.02,0.00,0.0,0.00,0.00,0.0,...,0.0,0.0,0.0,0.00,0.00,0.0,0.00,0.00,0.00,0.16
3,ARE,United Arab Emirates,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.0,...,0.0,0.0,0.0,0.00,0.00,0.0,0.00,0.00,0.00,0.00
4,ARG,Argentina,0.00,0.24,0.24,0.00,0.0,0.23,0.00,0.0,...,0.0,0.0,0.0,0.00,0.05,0.0,0.00,0.01,0.00,0.11

# Importing HDF5 files

In [68]:
import h5py
filename = 'data\L-L1_LOSC_4_V1-1126259446-32.hdf5'
data = h5py.File(filename, 'r')
type(data)

h5py._hl.files.File

In [69]:
# The structure of HDF5 files
for key in data.keys():
    print(key)

meta
quality
strain

In [70]:
type(data['meta'])

h5py._hl.group.Group

In [73]:
for key in data['meta'].keys():
    print(key)

Description
DescriptionURL
Detector
Duration
GPSstart
Observatory
Type
UTCstart

In [78]:
type(data['meta']['Description'])

h5py._hl.dataset.Dataset

In [79]:
np.array(data['meta']['Description'])

array(b'Strain data time series from LIGO', dtype='|S33')

In [80]:
np.array(data['meta']['Detector'])

array(b'L1', dtype='|S2')

# Importing MATLAB files
- scipy.io.loadmat() = read .mat file
- scipy.io.savemat() = write .mat file

In [81]:
import scipy.io
filename = 'data\ja_data2.mat'
mat = scipy.io.loadmat(filename)

In [82]:
type(mat)

dict

In [83]:
mat.keys()

dict_keys(['__header__', '__version__', '__globals__', 'rfpCyt', 'rfpNuc', 'cfpNuc', 'cfpCyt', 'yfpNuc', 'yfpCyt', 'CYratioCyt'])

In [84]:
np.shape(mat['CYratioCyt'])

(200, 137)

# Creating a database engine

In [35]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///data/Chinook.sqlite')

In [36]:
# version older than v 14
# table_names = engine.table_names()

In [37]:
inspection = inspect(engine)
inspection.get_schema_names()

['main']

In [38]:
inspection.get_table_names()

['Album',
 'Artist',
 'Customer',
 'Employee',
 'Genre',
 'Invoice',
 'InvoiceLine',
 'MediaType',
 'Playlist',
 'PlaylistTrack',
 'Track']

In [21]:
from sqlalchemy import text
import pandas as pd
con = engine.connect()
query = "SELECT * FROM Album;"
rs = con.execute(text(query))
df = pd.DataFrame(rs.fetchall()) # get all raws
df.columns = rs.keys() # get the name of the columns
con.close()

In [22]:
df

     AlbumId                                              Title  ArtistId
0          1              For Those About To Rock We Salute You         1
1          2                                  Balls to the Wall         2
2          3                                  Restless and Wild         2
3          4                                  Let There Be Rock         1
4          5                                           Big Ones         3
..       ...                                                ...       ...
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 3 columns]

In [2]:
### Context manager
from sqlalchemy import create_engine, text
import pandas as pd

engine = create_engine('sqlite:///data/Chinook.sqlite')

with engine.connect() as con:
    query = "SELECT * FROM MediaType;"
    rs = con.execute(text(query))
    df = pd.DataFrame(rs.fetchmany(size =3)) # get 3 raws
    df.columns = rs.keys()

In [59]:
df

   MediaTypeId                         Name
0            1              MPEG audio file
1            2     Protected AAC audio file
2            3  Protected MPEG-4 video file

In [62]:
engine = create_engine('sqlite:///data/Chinook.sqlite')

with engine.connect() as con:
    query = "SELECT * FROM Album WHERE ArtistId >4;"
    rs = con.execute(text(query))
    df = pd.DataFrame(rs.fetchall()) 
    df.columns = rs.keys()
df.head()

   AlbumId                           Title  ArtistId
0        7                        Facelift         5
1        8                  Warner 25 Anos         6
2       34          Chill: Brazil (Disc 2)         6
3        9  Plays Metallica By Four Cellos         7
4       10                      Audioslave         8

In [12]:
engine = create_engine('sqlite:///data/Chinook.sqlite')

with engine.connect() as con:
    query = 'SELECT * FROM Employee ORDER BY BirthDate'
    rs = con.execute(text(query))
    df = pd.DataFrame(rs.fetchall()) 
    df.columns = rs.keys()
df.head(2)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com

### Importing SQL by Pandas

In [16]:
from sqlalchemy import create_engine, text  
import pandas as pd

engine = create_engine('sqlite:///data/Chinook.sqlite')
con = engine.connect()
query = 'SELECT * FROM Employee ORDER BY BirthDate'
df1 = pd.read_sql_query(text(query), con)
df1.head(2)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com

In [17]:
con.close()
df.equals(df1)

True

### JOIN

In [26]:
from sqlalchemy import create_engine, text  
import pandas as pd

engine = create_engine('sqlite:///data/Chinook.sqlite')
con = engine.connect()
query = 'SELECT AlbumID, Title, Album.ArtistID, Name FROM Album INNER JOIN Artist on Album.ArtistId = Artist.ArtistId'
df2 = pd.read_sql_query(text(query), con)
df2.head(2)

   AlbumId                                  Title  ArtistId    Name
0        1  For Those About To Rock We Salute You         1   AC/DC
1        2                      Balls to the Wall         2  Accept